# Import dependencies

In [1]:
import os
import pandas as pd
import numpy as np

# Study data files: Toronto files:

In [2]:
toronto_Q1_path = os.path.join("Resources","2019-Q1.csv")
toronto_Q2_path = os.path.join("Resources", "2019-Q2.csv")
toronto_Q3_path = os.path.join("Resources", "2019-Q3.csv")
toronto_Q4_path = os.path.join("Resources", "2019-Q4.csv")

# Read the data and study the results:

In [3]:
q1 = pd.read_csv(toronto_Q1_path, encoding="utf=8")
q2 = pd.read_csv(toronto_Q2_path, encoding="utf=8")
q3 = pd.read_csv(toronto_Q3_path, encoding="utf=8")
q4 = pd.read_csv(toronto_Q4_path, encoding="utf=8")

Renaming the columns:

In [4]:
q1 = q1.rename(columns={"Trip  Duration": "Trip Duration"})
q2 = q2.rename(columns={"Trip  Duration": "Trip Duration"})
q3 = q3.rename(columns={"Trip  Duration": "Trip Duration"})
q4 = q4.rename(columns={"Trip  Duration": "Trip Duration"})

Creating DataFrame:

In [5]:
Toronto = [q1, q2, q3, q4]
bike_share = pd.concat(Toronto)
bike_share.head()

,Trip Id,Subscription Id,Trip Duration,Start Station Id,Start Time,Start Station Name,End Station Id,End Time,End Station Name,Bike Id,User Type
0,4581278,199751,1547,7021,01/01/2019 00:08,Bay St / Albert St,7233.0,01/01/2019 00:33,King / Cowan Ave - SMART,1296,Annual Member
1,4581279,294730,1112,7160,01/01/2019 00:10,King St W / Tecumseth St,7051.0,01/01/2019 00:29,Wellesley St E / Yonge St (Green P),2947,Annual Member
2,4581280,197252,589,7055,01/01/2019 00:15,Jarvis St / Carlton St,7013.0,01/01/2019 00:25,Scott St / The Esplanade,2293,Annual Member
3,4581281,171700,259,7012,01/01/2019 00:16,Elizabeth St / Edward St (Bus Terminal),7235.0,01/01/2019 00:20,Bay St / College St (West Side) - SMART,283,Annual Member
4,4581282,306314,281,7041,01/01/2019 00:19,Edward St / Yonge St,7257.0,01/01/2019 00:24,Dundas St W / St. Patrick St,1799,Annual Member

Deleting column "Trip Duration,Subscription Id,Start Station Name, End Station Name"

In [6]:
del bike_share['Trip Id']
del bike_share['Subscription Id']
del bike_share['Start Station Name']
del bike_share['End Station Name']
bike_share.head()

,Trip Duration,Start Station Id,Start Time,End Station Id,End Time,Bike Id,User Type
0,1547,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member
1,1112,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member
2,589,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member
3,259,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member
4,281,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member

Renaming columns in the created dataframe

In [64]:
bike_share = bike_share.rename(columns={"Trip Duration": "trip_duration",
                                        "Start Station Id":"start_station_id",
                                        "End Station Id":"end_station_id",
                                        "Start Time":"start_date",
                                        "End Time":"end_date",
                                        "Bike Id":"bike_id",
                                        "User Type":"member_type"
                                       })
bike_share.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

Identifying incomplete rows and Drop all rows with missing information

In [65]:
bike_share.count()

trip_duration       2439063
start_date          2439063
end_date            2439063
start_station_id    2439063
end_station_id      2439063
bike_id             2439063
member_type         2439063
location_id         2439063
dtype: int64

In [66]:
bike_share = bike_share.dropna()

In [67]:
bike_share.count()

trip_duration       2439063
start_date          2439063
end_date            2439063
start_station_id    2439063
end_station_id      2439063
bike_id             2439063
member_type         2439063
location_id         2439063
dtype: int64

Adding new column:location_id

In [68]:
bike_share = bike_share.assign(location_id=1)
bike_share.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

Rearrange columns

In [70]:
bike_share = bike_share[["trip_duration","start_date","end_date",
                         "start_station_id","end_station_id","bike_id",
                         "member_type","location_id"]]
bike_share.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

Creating Bikes dataframe with the following columns: BikeID & location_id

In [71]:
bikes = pd.DataFrame(bike_share[["bike_id","location_id"]])
bikes = bikes.drop_duplicates().reset_index(drop=True)
bikes.head()

   bike_id  location_id
0     1296            1
1     2947            1
2     2293            1
3      283            1
4     1799            1

Creating MemberType dataframe with the following columns: id,type & location_id

In [72]:
MemberType = pd.DataFrame(bike_share[["member_type","location_id"]])
MemberType = MemberType.drop_duplicates().reset_index(drop=True)
MemberType.rename_axis('ID')
MemberType

     member_type  location_id
0  Annual Member            1
1  Casual Member            1

In [73]:
bike_share.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

In [74]:
# Save Combined DataFrames to CSV
bike_share.to_csv("Toronto_bikeshare.csv", index=False, header=True)

In [75]:
bikes.to_csv("toronto_bikes.csv", index=False, header=True)

In [76]:
MemberType.to_csv("toronto_MemberType.csv", index=False, header=True)

## Load to BikeShareDB

In [79]:
import sqlalchemy
from sqlalchemy import create_engine, func
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from config import conn_string

In [80]:
# connect to database
cnx = f'postgresql://{conn_string}'
engine = create_engine(cnx)

In [81]:
engine.table_names()

['locations', 'membertypes', 'stations', 'bikes', 'ridership', 'pricing']

In [82]:
# reflect database into ORM classes
Base = automap_base()
Base.prepare(engine, reflect=True)
Base.classes.keys()

['locations', 'membertypes', 'stations', 'bikes', 'ridership', 'pricing']

In [83]:
# Save a reference to stations and bikes tables
Stations = Base.classes.stations
Bikes = Base.classes.bikes

In [84]:
# create session
session = Session(engine)

In [97]:
# check refential integrity for station ids on start_station_id and end_station_id
# 1. query stations table
stns = session.query(Stations.station_id).filter(Stations.location_id == 1).filter(Stations.station_id==7021).all()
stns_df = pd.DataFrame(stns)
stns_df

   station_id
0        7021

In [93]:
# 2. check that all start_station_id and end_station_id in bike_share exists in stations table
start_stn = pd.DataFrame(bike_share[["start_station_id"]])
start_stn = start_stn.drop_duplicates().reset_index(drop=True)
start_stn

missing = start_stn.loc[~start_stn["start_station_id"].isin(stns_df)]
missing

     start_station_id
0                7021
1                7160
2                7055
3                7012
4                7041
..                ...
464              7485
465              7506
466              7510
467              7394
468              7511

[469 rows x 1 columns]

In [27]:
# load bikes to Bikes table
bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [28]:
MemberType.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
bike_share.to_sql(name='ridership', con=engine, if_exists='append', index)